# VD 26
- Few Part of VD 26 was added in 3_Pandas File

### **1) Import Data and Load Data**
- **Option 1:** path + File name with Extention
- Syntax: pd.read_excel = ("path")
- **Note:** Use \\ or /
- 
- **Option 2:** Save the File in current working Directory and you can use without extention

- rows = records

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Option1
df = pd.read_excel('/Users/prasad/Prasad Folder/DATA_SCIENCE_&_GEN-AI/Data_Science_Practice/1_Python_For_Data_Science/practexcel.xlsx')
print(df)

   x   y   z
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [3]:
#Option 2
c = pd.read_excel("practexcel.xlsx")
print(c)

   x   y   z
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

**- To read all the contents of file use this Code and make sure to write it on first line**

In [4]:
# pd.set_option("display.max_rows",None)

**Functions**

**1.1)To Print First Five Records**

In [5]:
df.head()

   x   y   z
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

**1.2)To Print the records accrding to you Records**

In [6]:
df.head(n = 2)

   x  y   z
0  1  6  11
1  2  7  12

**1.3)To Print last 5 records**

In [7]:
df.tail(n=1)

   x   y   z
4  5  10  15

In [8]:
df.tail()

   x   y   z
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

**1.4) TO get the dimention of the Dataframe**

In [9]:
df.shape

(5, 3)

**1.5) Return on int representing the number of elements**

In [10]:
df.size

15

**1.6) Column name/ var name**

In [11]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

- Another way

In [12]:
df.keys()

Index(['x', 'y', 'z'], dtype='object')

##### VD 27

### **2) Data Understanding**
    - Understand each and every column name very clearly.
    - If you don't know contact domain Expert ( NOTE : While working in Company consider this otherwise ignore in personal usage)
    - Research by youself (Google, ChatGPT)

#### **2.1) Importing Tips excel file and we are going to Perform Few Operations**

In [13]:
df = pd.read_excel('/Users/prasad/Prasad Folder/DATA_SCIENCE_&_GEN-AI/Data_Science_Practice/1_Python_For_Data_Science/tips.xlsx')
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

**2.2) Renaming The column name**

In [14]:
df = df.rename(columns = {"sex":"gender", "size":"no_of_members"})
df

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

**2.3) To Know the Data Type of each column**
    
    
    - If each value within the column belongs to only one data type then only it will show the data type otherwise it will show object , suppose in case of column with whole int values then it will show if there is a single value with str then it will show that dtype as object

In [15]:
df.dtypes

total_bill          float64
tip                 float64
gender               object
smoker               object
day                  object
time                 object
no_of_members         int64
price_per_person    float64
Payer Name           object
CC Number             int64
Payment ID           object
dtype: object

**2.4) To get concise summary of DataFrame**

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   gender            244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   no_of_members     244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [17]:
numerical = ["total_bill","tip","no_of_members"]
non_numerical = ["gender","smoker","day","time"]

**2.5) Check for missing Values**

In [18]:
df.isnull()

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
239,False,False,False,False,False,False,False,False,False,False,False
240,False,False,False,False,False,False,False,False,False,False,False
241,False,False,False,False,False,False,False,False,False,False,False
242,False,False,False,False,False,False,False,False,False,False,False
243,False,False,False,False,False,False,False,False,False,False,False

- TO get addition of all the missing values in each column

In [19]:
df.isnull().sum()

total_bill          0
tip                 0
gender              0
smoker              0
day                 0
time                0
no_of_members       0
price_per_person    0
Payer Name          0
CC Number           0
Payment ID          0
dtype: int64

### **3) Extracting / Accessing the Data from the Data Set i.e tips**
- Here we are using previoously imported Dataset

In [20]:
df

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

**3.1) Extraction Based on Index Number**

In [21]:
df.iloc[[2,3,4,5],0]

2    21.01
3    23.68
4    24.59
5    25.29
Name: total_bill, dtype: float64

**3.2) Extraction Based on Index Name**

In [22]:
df.loc[[2,3,4,5],["total_bill"]]

   total_bill
2       21.01
3       23.68
4       24.59
5       25.29

#### **3.3) Extract the data of a single column with all records(rows)**

**3.3.1) Option 1**

In [23]:
# Here we are extracting all the rows and total_bill column by using index number
df.iloc[:,0]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

**3.3.2) Option 2**

In [24]:
# Here we are extracting all the rows and total_bill column by using index name
df.loc[:,"total_bill"]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

**3.3.3) Option 3**

    - Note: This Option will only work when column name is as per the index

**3.3.4) Option 4**

In [25]:
df["total_bill"] # This is used in pd - series i.e 1D

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

**3.3.5) Option 5**

In [26]:
df[["total_bill"]] # This is same as above just we used pd DataFrame i.e 2D

     total_bill
0         16.99
1         10.34
2         21.01
3         23.68
4         24.59
..          ...
239       29.03
240       27.18
241       22.67
242       17.82
243       18.78

[244 rows x 1 columns]

#### **3.4) To Extract the data of a Multiple column with all records(rows)**

**3.4.1) Option 1**

In [27]:
# Here we have Extraced data from total_bill ad tip column
df[["total_bill","tip"]]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

**3.4.2) Option 2**

In [28]:
# Here we have declared new variable and called it from df
numerical = ["total_bill","tip","no_of_members"]
df[numerical]

     total_bill   tip  no_of_members
0         16.99  1.01              2
1         10.34  1.66              3
2         21.01  3.50              3
3         23.68  3.31              2
4         24.59  3.61              4
..          ...   ...            ...
239       29.03  5.92              3
240       27.18  2.00              2
241       22.67  2.00              2
242       17.82  1.75              2
243       18.78  3.00              2

[244 rows x 3 columns]

#### **3.5)Convert pd series to 1D Array**

**3.5.1) Option 1**

In [29]:
df["total_bill"].values

array([16.99, 10.34, 21.01, 23.68, 24.59, 25.29,  8.77, 26.88, 15.04,
       14.78, 10.27, 35.26, 15.42, 18.43, 14.83, 21.58, 10.33, 16.29,
       16.97, 20.65, 17.92, 20.29, 15.77, 39.42, 19.82, 17.81, 13.37,
       12.69, 21.7 , 19.65,  9.55, 18.35, 15.06, 20.69, 17.78, 24.06,
       16.31, 16.93, 18.69, 31.27, 16.04, 17.46, 13.94,  9.68, 30.4 ,
       18.29, 22.23, 32.4 , 28.55, 18.04, 12.54, 10.29, 34.81,  9.94,
       25.56, 19.49, 38.01, 26.41, 11.24, 48.27, 20.29, 13.81, 11.02,
       18.29, 17.59, 20.08, 16.45,  3.07, 20.23, 15.01, 12.02, 17.07,
       26.86, 25.28, 14.73, 10.51, 17.92, 27.2 , 22.76, 17.29, 19.44,
       16.66, 10.07, 32.68, 15.98, 34.83, 13.03, 18.28, 24.71, 21.16,
       28.97, 22.49,  5.75, 16.32, 22.75, 40.17, 27.28, 12.03, 21.01,
       12.46, 11.35, 15.38, 44.3 , 22.42, 20.92, 15.36, 20.49, 25.21,
       18.24, 14.31, 14.  ,  7.25, 38.07, 23.95, 25.71, 17.31, 29.93,
       10.65, 12.43, 24.08, 11.69, 13.42, 14.26, 15.95, 12.48, 29.8 ,
        8.52, 14.52, 11.38, 22.82, 19.08, 20.27, 11.17, 12.26, 18.26,
        8.51, 10.33, 14.15, 16.  , 13.16, 17.47, 34.3 , 41.19, 27.05,
       16.43,  8.35, 18.64, 11.87,  9.78,  7.51, 14.07, 13.13, 17.26,
       24.55, 19.77, 29.85, 48.17, 25.  , 13.39, 16.49, 21.5 , 12.66,
       16.21, 13.81, 17.51, 24.52, 20.76, 31.71, 10.59, 10.63, 50.81,
       15.81,  7.25, 31.85, 16.82, 32.9 , 17.89, 14.48,  9.6 , 34.63,
       34.65, 23.33, 45.35, 23.17, 40.55, 20.69, 20.9 , 30.46, 18.15,
       23.1 , 15.69, 19.81, 28.44, 15.48, 16.58,  7.56, 10.34, 43.11,
       13.  , 13.51, 18.71, 12.74, 13.  , 16.4 , 20.53, 16.47, 26.59,
       38.73, 24.27, 12.76, 30.06, 25.89, 48.33, 13.27, 28.17, 12.9 ,
       28.15, 11.59,  7.74, 30.14, 12.16, 13.42,  8.58, 15.98, 13.42,
       16.27, 10.09, 20.45, 13.28, 22.12, 24.01, 15.69, 11.61, 10.77,
       15.53, 10.07, 12.6 , 32.83, 35.83, 29.03, 27.18, 22.67, 17.82,
       18.78])

**3.5.2) Option 2**

In [30]:
df["total_bill"].to_numpy()

array([16.99, 10.34, 21.01, 23.68, 24.59, 25.29,  8.77, 26.88, 15.04,
       14.78, 10.27, 35.26, 15.42, 18.43, 14.83, 21.58, 10.33, 16.29,
       16.97, 20.65, 17.92, 20.29, 15.77, 39.42, 19.82, 17.81, 13.37,
       12.69, 21.7 , 19.65,  9.55, 18.35, 15.06, 20.69, 17.78, 24.06,
       16.31, 16.93, 18.69, 31.27, 16.04, 17.46, 13.94,  9.68, 30.4 ,
       18.29, 22.23, 32.4 , 28.55, 18.04, 12.54, 10.29, 34.81,  9.94,
       25.56, 19.49, 38.01, 26.41, 11.24, 48.27, 20.29, 13.81, 11.02,
       18.29, 17.59, 20.08, 16.45,  3.07, 20.23, 15.01, 12.02, 17.07,
       26.86, 25.28, 14.73, 10.51, 17.92, 27.2 , 22.76, 17.29, 19.44,
       16.66, 10.07, 32.68, 15.98, 34.83, 13.03, 18.28, 24.71, 21.16,
       28.97, 22.49,  5.75, 16.32, 22.75, 40.17, 27.28, 12.03, 21.01,
       12.46, 11.35, 15.38, 44.3 , 22.42, 20.92, 15.36, 20.49, 25.21,
       18.24, 14.31, 14.  ,  7.25, 38.07, 23.95, 25.71, 17.31, 29.93,
       10.65, 12.43, 24.08, 11.69, 13.42, 14.26, 15.95, 12.48, 29.8 ,
        8.52, 14.52, 11.38, 22.82, 19.08, 20.27, 11.17, 12.26, 18.26,
        8.51, 10.33, 14.15, 16.  , 13.16, 17.47, 34.3 , 41.19, 27.05,
       16.43,  8.35, 18.64, 11.87,  9.78,  7.51, 14.07, 13.13, 17.26,
       24.55, 19.77, 29.85, 48.17, 25.  , 13.39, 16.49, 21.5 , 12.66,
       16.21, 13.81, 17.51, 24.52, 20.76, 31.71, 10.59, 10.63, 50.81,
       15.81,  7.25, 31.85, 16.82, 32.9 , 17.89, 14.48,  9.6 , 34.63,
       34.65, 23.33, 45.35, 23.17, 40.55, 20.69, 20.9 , 30.46, 18.15,
       23.1 , 15.69, 19.81, 28.44, 15.48, 16.58,  7.56, 10.34, 43.11,
       13.  , 13.51, 18.71, 12.74, 13.  , 16.4 , 20.53, 16.47, 26.59,
       38.73, 24.27, 12.76, 30.06, 25.89, 48.33, 13.27, 28.17, 12.9 ,
       28.15, 11.59,  7.74, 30.14, 12.16, 13.42,  8.58, 15.98, 13.42,
       16.27, 10.09, 20.45, 13.28, 22.12, 24.01, 15.69, 11.61, 10.77,
       15.53, 10.07, 12.6 , 32.83, 35.83, 29.03, 27.18, 22.67, 17.82,
       18.78])

#### **3.6)Convert pd Datafram to 2D Array**

**3.6.1) Option 1**

In [31]:
df[["total_bill"]].to_numpy()

array([[16.99],
       [10.34],
       [21.01],
       [23.68],
       [24.59],
       [25.29],
       [ 8.77],
       [26.88],
       [15.04],
       [14.78],
       [10.27],
       [35.26],
       [15.42],
       [18.43],
       [14.83],
       [21.58],
       [10.33],
       [16.29],
       [16.97],
       [20.65],
       [17.92],
       [20.29],
       [15.77],
       [39.42],
       [19.82],
       [17.81],
       [13.37],
       [12.69],
       [21.7 ],
       [19.65],
       [ 9.55],
       [18.35],
       [15.06],
       [20.69],
       [17.78],
       [24.06],
       [16.31],
       [16.93],
       [18.69],
       [31.27],
       [16.04],
       [17.46],
       [13.94],
       [ 9.68],
       [30.4 ],
       [18.29],
       [22.23],
       [32.4 ],
       [28.55],
       [18.04],
       [12.54],
       [10.29],
       [34.81],
       [ 9.94],
       [25.56],
       [19.49],
       [38.01],
       [26.41],
       [11.24],
       [48.27],
       [20.29],
       [13.81],
       [11.02],
       [18.29],
       [17.59],
       [20.08],
       [16.45],
       [ 3.07],
       [20.23],
       [15.01],
       [12.02],
       [17.07],
       [26.86],
       [25.28],
       [14.73],
       [10.51],
       [17.92],
       [27.2 ],
       [22.76],
       [17.29],
       [19.44],
       [16.66],
       [10.07],
       [32.68],
       [15.98],
       [34.83],
       [13.03],
       [18.28],
       [24.71],
       [21.16],
       [28.97],
       [22.49],
       [ 5.75],
       [16.32],
       [22.75],
       [40.17],
       [27.28],
       [12.03],
       [21.01],
       [12.46],
       [11.35],
       [15.38],
       [44.3 ],
       [22.42],
       [20.92],
       [15.36],
       [20.49],
       [25.21],
       [18.24],
       [14.31],
       [14.  ],
       [ 7.25],
       [38.07],
       [23.95],
       [25.71],
       [17.31],
       [29.93],
       [10.65],
       [12.43],
       [24.08],
       [11.69],
       [13.42],
       [14.26],
       [15.95],
       [12.48],
       [29.8 ],
       [ 8.52],
       [14.52],
       [11.38],
       [22.82],
       [19.08],
       [20.27],
       [11.17],
       [12.26],
       [18.26],
       [ 8.51],
       [10.33],
       [14.15],
       [16.  ],
       [13.16],
       [17.47],
       [34.3 ],
       [41.19],
       [27.05],
       [16.43],
       [ 8.35],
       [18.64],
       [11.87],
       [ 9.78],
       [ 7.51],
       [14.07],
       [13.13],
       [17.26],
       [24.55],
       [19.77],
       [29.85],
       [48.17],
       [25.  ],
       [13.39],
       [16.49],
       [21.5 ],
       [12.66],
       [16.21],
       [13.81],
       [17.51],
       [24.52],
       [20.76],
       [31.71],
       [10.59],
       [10.63],
       [50.81],
       [15.81],
       [ 7.25],
       [31.85],
       [16.82],
       [32.9 ],
       [17.89],
       [14.48],
       [ 9.6 ],
       [34.63],
       [34.65],
       [23.33],
       [45.35],
       [23.17],
       [40.55],
       [20.69],
       [20.9 ],
       [30.46],
       [18.15],
       [23.1 ],
       [15.69],
       [19.81],
       [28.44],
       [15.48],
       [16.58],
       [ 7.56],
       [10.34],
       [43.11],
       [13.  ],
       [13.51],
       [18.71],
       [12.74],
       [13.  ],
       [16.4 ],
       [20.53],
       [16.47],
       [26.59],
       [38.73],
       [24.27],
       [12.76],
       [30.06],
       [25.89],
       [48.33],
       [13.27],
       [28.17],
       [12.9 ],
       [28.15],
       [11.59],
       [ 7.74],
       [30.14],
       [12.16],
       [13.42],
       [ 8.58],
       [15.98],
       [13.42],
       [16.27],
       [10.09],
       [20.45],
       [13.28],
       [22.12],
       [24.01],
       [15.69],
       [11.61],
       [10.77],
       [15.53],
       [10.07],
       [12.6 ],
       [32.83],
       [35.83],
       [29.03],
       [27.18],
       [22.67],
       [17.82],
       [18.78]])

**3.5.2) Option 2**

In [32]:
df[["total_bill"]].values

array([[16.99],
       [10.34],
       [21.01],
       [23.68],
       [24.59],
       [25.29],
       [ 8.77],
       [26.88],
       [15.04],
       [14.78],
       [10.27],
       [35.26],
       [15.42],
       [18.43],
       [14.83],
       [21.58],
       [10.33],
       [16.29],
       [16.97],
       [20.65],
       [17.92],
       [20.29],
       [15.77],
       [39.42],
       [19.82],
       [17.81],
       [13.37],
       [12.69],
       [21.7 ],
       [19.65],
       [ 9.55],
       [18.35],
       [15.06],
       [20.69],
       [17.78],
       [24.06],
       [16.31],
       [16.93],
       [18.69],
       [31.27],
       [16.04],
       [17.46],
       [13.94],
       [ 9.68],
       [30.4 ],
       [18.29],
       [22.23],
       [32.4 ],
       [28.55],
       [18.04],
       [12.54],
       [10.29],
       [34.81],
       [ 9.94],
       [25.56],
       [19.49],
       [38.01],
       [26.41],
       [11.24],
       [48.27],
       [20.29],
       [13.81],
       [11.02],
       [18.29],
       [17.59],
       [20.08],
       [16.45],
       [ 3.07],
       [20.23],
       [15.01],
       [12.02],
       [17.07],
       [26.86],
       [25.28],
       [14.73],
       [10.51],
       [17.92],
       [27.2 ],
       [22.76],
       [17.29],
       [19.44],
       [16.66],
       [10.07],
       [32.68],
       [15.98],
       [34.83],
       [13.03],
       [18.28],
       [24.71],
       [21.16],
       [28.97],
       [22.49],
       [ 5.75],
       [16.32],
       [22.75],
       [40.17],
       [27.28],
       [12.03],
       [21.01],
       [12.46],
       [11.35],
       [15.38],
       [44.3 ],
       [22.42],
       [20.92],
       [15.36],
       [20.49],
       [25.21],
       [18.24],
       [14.31],
       [14.  ],
       [ 7.25],
       [38.07],
       [23.95],
       [25.71],
       [17.31],
       [29.93],
       [10.65],
       [12.43],
       [24.08],
       [11.69],
       [13.42],
       [14.26],
       [15.95],
       [12.48],
       [29.8 ],
       [ 8.52],
       [14.52],
       [11.38],
       [22.82],
       [19.08],
       [20.27],
       [11.17],
       [12.26],
       [18.26],
       [ 8.51],
       [10.33],
       [14.15],
       [16.  ],
       [13.16],
       [17.47],
       [34.3 ],
       [41.19],
       [27.05],
       [16.43],
       [ 8.35],
       [18.64],
       [11.87],
       [ 9.78],
       [ 7.51],
       [14.07],
       [13.13],
       [17.26],
       [24.55],
       [19.77],
       [29.85],
       [48.17],
       [25.  ],
       [13.39],
       [16.49],
       [21.5 ],
       [12.66],
       [16.21],
       [13.81],
       [17.51],
       [24.52],
       [20.76],
       [31.71],
       [10.59],
       [10.63],
       [50.81],
       [15.81],
       [ 7.25],
       [31.85],
       [16.82],
       [32.9 ],
       [17.89],
       [14.48],
       [ 9.6 ],
       [34.63],
       [34.65],
       [23.33],
       [45.35],
       [23.17],
       [40.55],
       [20.69],
       [20.9 ],
       [30.46],
       [18.15],
       [23.1 ],
       [15.69],
       [19.81],
       [28.44],
       [15.48],
       [16.58],
       [ 7.56],
       [10.34],
       [43.11],
       [13.  ],
       [13.51],
       [18.71],
       [12.74],
       [13.  ],
       [16.4 ],
       [20.53],
       [16.47],
       [26.59],
       [38.73],
       [24.27],
       [12.76],
       [30.06],
       [25.89],
       [48.33],
       [13.27],
       [28.17],
       [12.9 ],
       [28.15],
       [11.59],
       [ 7.74],
       [30.14],
       [12.16],
       [13.42],
       [ 8.58],
       [15.98],
       [13.42],
       [16.27],
       [10.09],
       [20.45],
       [13.28],
       [22.12],
       [24.01],
       [15.69],
       [11.61],
       [10.77],
       [15.53],
       [10.07],
       [12.6 ],
       [32.83],
       [35.83],
       [29.03],
       [27.18],
       [22.67],
       [17.82],
       [18.78]])

### **4) Filtering**
    - selecting/extracting the data based on conditions.

**syntax:** df[condition]

In [53]:
# Here we are Extracting the data in with the tip is greater than 7
df[df["tip"]>=7]

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID,bill_category
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,good
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,good
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,good

In [34]:
# Here we are Extracting the data in which only male are there
df[df["gender"]== "Male"]

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
...,...,...,...,...,...,...,...,...,...,...,...
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

#### **4.1) Filtering using multiple conditions**

**Syntax:** df[(condition1) or'|' and '&' (condition2)]

In [55]:
# Here we have extracted total bill is greater than 40 and the gender is female
df[(df["total_bill"]>40) & (df["gender"]=="Female" )]

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID,bill_category
102,44.30,2.5,Female,Yes,Sat,Dinner,3,14.77,Heather Cohen,379771118886604,Sat6240,good
197,43.11,5.0,Female,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313,good

In [36]:
# Here we have extracted total bill is greater than 40 and the gender is Male
df[(df["total_bill"]>40) & (df["gender"]=="Male")]

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590

In [58]:
# Here we have extracted tip is greater than or equal to 7 or members should be equal to 6
df[(df['tip']>=7) | (df['no_of_members']==6)]

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID,bill_category
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,good
125,29.80,4.20,Female,No,Thur,Lunch,6,4.97,Angela Sanchez,503857080488,Thur3948,moderate
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,good
143,27.05,5.00,Female,No,Thur,Lunch,6,4.51,Regina Jones,4311048695487,Thur6179,moderate
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518,good
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,good
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,good

In [38]:
# Here we have extracted total bill is greater than or equal to  40 or tip is greater than or equal to 7  or the gender is Male
df[(df['total_bill']>=40) | (df['tip']>=7) & (df['gender']=="Female" )]

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628
102,44.30,2.50,Female,Yes,Sat,Dinner,3,14.77,Heather Cohen,379771118886604,Sat6240
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140
197,43.11,5.00,Female,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590

In [39]:
# Here we have extracted day is sunday and gender is male
df[(df["day"]=="Sun") & (df["gender"]=="Male" )]

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546
12,15.42,1.57,Male,No,Sun,Dinner,2,7.71,Chad Harrington,577040572932,Sun1300
13,18.43,3.00,Male,No,Sun,Dinner,4,4.61,Joshua Jones,6011163105616890,Sun2971
15,21.58,3.92,Male,No,Sun,Dinner,2,10.79,Matthew Reilly,180073029785069,Sun1878
17,16.29,3.71,Male,No,Sun,Dinner,3,5.43,John Pittman,6521340257218708,Sun2998
41,17.46,2.54,Male,No,Sun,Dinner,2,8.73,David Boyer,3536678244278149,Sun9460
42,13.94,3.06,Male,No,Sun,Dinner,2,6.97,Bryan Brown,36231182760859,Sun1699
43,9.68,1.32,Male,No,Sun,Dinner,2,4.84,Christopher Spears,4387671121369212,Sun3279
44,30.40,5.60,Male,No,Sun,Dinner,4,7.60,Todd Cooper,503846761263,Sun2274
45,18.29,3.00,Male,No,Sun,Dinner,2,9.14,Richard Fitzgerald,375156610762053,Sun8643
46,22.23,5.00,Male,No,Sun,Dinner,2,11.12,Joshua Gilmore,4292072734899,Sun7097
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677
48,28.55,2.05,Male,No,Sun,Dinner,3,9.52,Austin Fisher,6011481668986587,Sun4142
49,18.04,3.00,Male,No,Sun,Dinner,2,9.02,William Roth,6573923967142503,Sun9774
50,12.54,2.50,Male,No,Sun,Dinner,2,6.27,Jeremiah Neal,2225400829691416,Sun2021
53,9.94,1.56,Male,No,Sun,Dinner,2,4.97,Curtis Morgan,4628628020417301,Sun4561
54,25.56,4.34,Male,No,Sun,Dinner,4,6.39,Ronald Owens,6569607991983380,Sun9470
55,19.49,3.51,Male,No,Sun,Dinner,2,9.74,Michael Hamilton,6502227786581768,Sun1118
112,38.07,4.00,Male,No,Sun,Dinner,3,12.69,Jeff Lopez,3572865915176463,Sun591
113,23.95,2.55,Male,No,Sun,Dinner,2,11.98,John Joyce,6565964211060570,Sun1885
116,29.93,5.07,Male,No,Sun,Dinner,4,7.48,Shawn Blake,4689079711213722,Sun22
150,14.07,2.50,Male,No,Sun,Dinner,2,7.04,Luke Rice,4813617017359506,Sun8863
151,13.13,2.00,Male,No,Sun,Dinner,2,6.56,Jason Arnold,3571825125296106,Sun2127
152,17.26,2.74,Male,No,Sun,Dinner,3,5.75,Gregory Smith,4292362333741,Sun5205
153,24.55,2.00,Male,No,Sun,Dinner,4,6.14,Todd Patterson,4416804908942159,Sun8670
154,19.77,2.00,Male,No,Sun,Dinner,4,4.94,James Smith,213169731428229,Sun5814
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
159,16.49,2.00,Male,No,Sun,Dinner,4,4.12,Christopher Soto,30501814271434,Sun1781
160,21.50,3.50,Male,No,Sun,Dinner,4,5.38,Travis Gonzalez,3527668419764685,Sun245
161,12.66,2.50,Male,No,Sun,Dinner,2,6.33,Brandon Oconnor,4406882156920533,Sun5879
163,13.81,2.00,Male,No,Sun,Dinner,2,6.90,Charles Newton,5552793481414044,Sun8594
165,24.52,3.48,Male,No,Sun,Dinner,3,8.17,Jacob Hansen,4031116007387,Sun9043
166,20.76,2.24,Male,No,Sun,Dinner,2,10.38,Gordon Lane,4110599849536479,Sun6738
167,31.71,4.50,Male,No,Sun,Dinner,4,7.93,Michael Lawson,3566285921227119,Sun3719
172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.62,Larry White,30432617123103,Sun9209
173,31.85,3.18,Male,Yes,Sun,Dinner,2,15.92,Scott Perez,3577115550328507,Sun9335
174,16.82,4.00,Male,Yes,Sun,Dinner,2,8.41,Brian Miles,3586342145399277,Sun7621
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan Reynolds,370307040837149,Sun5109
176,17.89,2.00,Male,Yes,Sun,Dinner,2,8.94,Walter Simmons,6011481578696110,Sun5961
177,14.48,2.00,Male,Yes,Sun,Dinner,2,7.24,John Dudley,4565183162071073,Sun6203
179,34.63,3.55,Male,Yes,Sun,Dinner,2,17.32,Brian Bailey,346656312114848,Sun9851
180,34.65,3.68,Male,Yes,Sun,Dinner,4,8.66,James Hebert DDS,676168737648,Sun7544
181,23.33,5.65,Male,Yes,Sun,Dinner,2,11.66,Jason Cox,6556931703586223,Sun3402
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337
183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.79,Dr. Michael James,4718501859162,Sun6059
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140
185,20.69,5.00,Male,No,Sun,Dinner,5,4.14,Joseph Howell,30362407455623,Sun5842
187,30.46,2.00,Male,Yes,Sun,Dinner,5,6.09,David Barrett,4792882899700988,Sun9987
189,23.10,4.00,Male,Yes,Sun,Dinner,3,7.70,Richard Stevens,3560193117506187,Sun1821
190,15.69,1.50,Male,Yes,Sun,Dinner,2,7.84,Riley Barnes,180053549128800,Sun5104

In [40]:
# Here we have extracted day is sunday and gender is Female

df[ (df["day"]=="Sun") & (df["gender"]=="Female")]

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
11,35.26,5.00,Female,No,Sun,Dinner,4,8.82,Diane Macias,4577817359320969,Sun6686
14,14.83,3.02,Female,No,Sun,Dinner,2,7.42,Vanessa Jones,30016702287574,Sun3848
16,10.33,1.67,Female,No,Sun,Dinner,3,3.44,Elizabeth Foster,4240025044626033,Sun9715
18,16.97,3.50,Female,No,Sun,Dinner,3,5.66,Laura Martinez,30422275171379,Sun2789
51,10.29,2.60,Female,No,Sun,Dinner,2,5.14,Jessica Ibarra,4999759463713,Sun4474
52,34.81,5.20,Female,No,Sun,Dinner,4,8.70,Emily Daniel,4291280793094374,Sun6165
114,25.71,4.00,Female,No,Sun,Dinner,3,8.57,Katie Smith,5400160161311292,Sun6492
115,17.31,3.50,Female,No,Sun,Dinner,2,8.65,Kayla Stone,379494319310858,Sun8746
155,29.85,5.14,Female,No,Sun,Dinner,5,5.97,Madison Wilson,4210875236164664,Sun9176
157,25.00,3.75,Female,No,Sun,Dinner,4,6.25,Laura Robles,213158685144262,Sun7015
158,13.39,2.61,Female,No,Sun,Dinner,2,6.70,Ashley Boyd,3571088058115021,Sun982
162,16.21,2.00,Female,No,Sun,Dinner,3,5.40,Jennifer Baird,4227834176859693,Sun5521
164,17.51,3.00,Female,Yes,Sun,Dinner,2,8.76,Audrey Griffin,3500853929693258,Sun444
178,9.60,4.00,Female,Yes,Sun,Dinner,2,4.80,Melanie Gray,4211808859168,Sun4598
186,20.90,3.50,Female,Yes,Sun,Dinner,3,6.97,Heidi Atkinson,4422858423131187,Sun4254
188,18.15,3.50,Female,Yes,Sun,Dinner,3,6.05,Glenda Wiggins,578329325307,Sun430

### **5) For Discrete Variable to check unique values**

In [41]:
# it means that connected with how good something is, rather than with how much of it there is.
qualitative = ['gender', 'smoker', 'day', 'time']

In [42]:
# TO get the unique val in gender column
df["gender"]. unique ()

array(['Female', 'Male'], dtype=object)

In [43]:
# To get the Unique value in Smoker Column 
df["smoker"].unique()

array(['No', 'Yes'], dtype=object)

In [44]:
# To get the Unique value in Day Column
df["day"]. unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [45]:
# To get the count od genders in gernder Column
df[ "gender"]. value_counts()

gender
Male      157
Female     87
Name: count, dtype: int64

In [46]:
# Option  1 to get percentage of gender count
df["gender"].value_counts()/len(df)

gender
Male      0.643443
Female    0.356557
Name: count, dtype: float64

In [47]:
# Option 2 to get percentage of gender count
df["gender"]. value_counts(normalize=True)

gender
Male      0.643443
Female    0.356557
Name: proportion, dtype: float64

In [59]:
df["time"].nunique()

2

### **6) Discretization**
    - Converting a numerical data to non numerical data

-So the Following code will create a new column named bill category and assigns the category of their bill means in bins we have declared that 0 to 10 is low and 10 to 30 is moderate and 30 to 50 is good accordingly it assigns the category and integrate the catgeory into the new column

In [49]:
df['bill_category'] = pd.cut(df['total_bill'],
                bins = [0,10,30,51],
                labels= ["low", "moderate" , "good"])
df

,total_bill,tip,gender,smoker,day,time,no_of_members,price_per_person,Payer Name,CC Number,Payment ID,bill_category
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,moderate
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,moderate
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,moderate
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,moderate
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,moderate
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,moderate
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,moderate
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,moderate
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,moderate
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,moderate

In [50]:
# This function will show the count of each category that we have recently created
df["bill_category"].value_counts()

bill_category
moderate    195
good         32
low          17
Name: count, dtype: int64

### **7) Cross Tab**
    -  It is applied on 2 non numerical data i.e text data

In [51]:
df[(df["time"]=="Dinner") & (df["gender"]=="Male")].shape[0]

124

In [52]:
pd.crosstab(df["time"],df["gender"])

gender  Female  Male
time
Dinner      52   124
Lunch       35    33